
expression_map = {
    #催眠表情
    "hypnosis": {
        "じと目": 0.383,
        "高光": 1,
        "口横缩げ": 0.06087,
        "口角下げ1":0.486957
    },
    "hypnosis_without_highlight": {
        "じと目": 0.383,
        "瞳縦潰れ": 1,
        "口横缩げ": 0.06087,
        "口角下げ1": 0.486957
    },
    #啊的口型
    "expectation":{
      "口横缩げ":0.513043,
      "口角下げ6":0.634783
    },
    "sad": {
        "眉毛下压": 0.7,
        "嘴角下垂": 0.5,
        "眼睛半闭": 0.4,
    },
    "angry": {
        "眉毛下压": 1.0,
        "嘴角紧闭": 0.8,
        "眼睛睁大": 0.5,
    },
}

# 表情对应的中文显示
expression_name_to_chinese = {
    "hypnosis":"催眠表情",
    "hypnosis_without_highlight":"催眠表情(不使用高光)",
    "expectation":"期待的嘴型",
    "smile": "笑",
    "sad": "难过",
    "angry": "生气",
}



# 基型
# 真面目
# 怒り
# 怒り1
# にこり
# にこり1
# 困る
# 困る1
# 上
# 下
# あ
# い
# い1
# う
# え
# お
# お1
# お2
# あ２
# 口上
# 口下
# 口横広げ
# 口横缩げ
# 口角下げ
# 口角下げ1
# 口角下げ2
# 口角下げ3
# 口角下げ4
# 口角下げ5
# 口角下げ6
# 口角上げ
# 口角上げ1
# □
# □0
# □2
# □3
# □4
# □5
# □6
# にやり２
# にやり3
# にやり4
# ワ
# ワ1
# ∞
# ∞1
# ∞2
# まばたき
# 笑い
# 笑い1
# 笑い2
# 笑い3
# ウィンク
# ウィンク右
# ウィンク２
# ｳｨﾝｸ２右
# ぺろっ
# ｷﾘｯ
# ｷﾘｯ1
# じと目
# じと目1
# じと目2
# じと目3
# びっくり
# びっくり1
# 瞳小
# 恐ろしい子！
# 瞳縦潰れ
# なごみ
# はちゅ目
# はぅ
# 照れ
# 高光